Repository: deemoowoor/django-registration
Catalog: registration/locale/*/LC_MESSAGES/django.po
Languages: et

source: Activate users
et: Aktiivsed kasutajad

source: Re-send activation emails
et: Saada aktiviseerimismeil uuesti

source: Username
et: Kasutajanimi

source: This value may contain only letters, numbers and @/./+/-/_ characters.
et: Palun kasutage ainult tähti, numbreid või sümboleid @/./+/-/_

source: Password
et: Salasõna

source: Password (again)
et: Salasõna (uuesti)

source: A user with that username already exists.
et: Antud kasutajanimi on juba kasutusel.

source: The two password fields didn't match.
et: Viga salasõna sisestamisel

source: I have read and agree to the Terms of Service
et: Olen Üldtingimustega tutvunud ning nõustun nendega

source: You must agree to the terms to register
et: Te peate nõustuma Üldtingimustega

source: This email address is already in use. Please supply a different email address.
et: See e-mail´i aadress on juba kasutusel. Palume sisestada uus e-mail.

source: Registration using free email addresses is prohibited. Please supply a different email address.
et: Registreerimine, kasutades tasuta e-maili on keelatud. Palume sisestada uus e-mail.

source: user
et: kasutaja

source: activation key
et: aktiveerimiskood

source: registration profile
et: registreerimise

source: registration profiles
et: registreerimise
